src/InformationRegisters/Scan_КвотыSOrderFFUПлан/Scan_КвотыSOrderFFUПлан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КвотыSOrderFFUПлан</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КвотаSOrderFFU</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Опция</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_ТипыОпций/Scan_ТипыОпций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ТипыОпций</name>
  <predefined>
    <items>
      <name>FFUОпции</name>
      <description>FFU</description>
    </items>
    <items>
      <name>SOrderОпции</name>
      <description>S-order</description>
    </items>
    <items>
      <name>БазовыеОпции</name>
      <description>Базовые</description>
    </items>
    <items>
      <name>ЛокальныеОпции</name>
      <description>Локальные</description>
    </items>
    <items>
      <name>ОпцииНадстроек</name>
      <description>Опции надстройки</description>
    </items>
    <items>
      <name>ОпцииОборудования</name>
      <description>Опции оборудования</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/Scan_КвотыSOrderFFUПлан/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТипОпцииSOrder 			= Справочники.Scan_ТипыОпций.SOrderОпции;
	ТипОпцииFFU 			= Справочники.Scan_ТипыОпций.FFUОпции;
	
	Если ТекущийОбъект.Опция.ТипОпции <> ТипОпцииSOrder И ТекущийОбъект.Опция.ТипОпции <> ТипОпцииFFU Тогда
		ТекстСообщения = "Неверный тип опции. Запись возможна только с типом опции S-order / FUU";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Запись.Опция",, Отказ);
	КонецЕсли;
КонецПроцедуры
